Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAA169.atdf
         <register caption="" name="CNFJ" offset="0x8b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFJ0" />
            <bitfield mask="0x00000002" name="CNFJ1" />
            <bitfield mask="0x00000004" name="CNFJ2" />
            <bitfield mask="0x00000008" name="CNFJ3" />
            <bitfield mask="0x00000010" name="CNFJ4" />
            <bitfield mask="0x00000020" name="CNFJ5" />
            <bitfield mask="0x00000040" name="CNFJ6" />
            <bitfield mask="0x00000080" name="CNFJ7" />
            <bitfield mask="0x00000100" name="CNFJ8" />
            <bitfield mask="0x00000200" name="CNFJ9" />
            <bitfield mask="0x00000400" name="CNFJ10" />
            <bitfield mask="0x00000800" name="CNFJ11" />
            <bitfield mask="0x00001000" name="CNFJ12" />
            <bitfield mask="0x00002000" name="CNFJ13" />
            <bitfield mask="0x00004000" name="CNFJ14" />
            <bitfield mask="0x00008000" name="CNFJ15" />
         </register>
         <register caption="" name="CNFK" offset="0x9b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFK0" />
            <bitfield mask="0x00000002" name="CNFK1" />
            <bitfield mask="0x00000004" name="CNFK2" />
            <bitfield mask="0x00000008" name="CNFK3" />
            <bitfield mask="0x00000010" name="CNFK4" />
            <bitfield mask="0x00000020" name="CNFK5" />
            <bitfield mask="0x00000040" name="CNFK6" />
            <bitfield mask="0x00000080" name="CNFK7" />
         </register>
         <register caption="" name="SRCON0A" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR0A0" />
            <bitfield mask="0x00000002" name="SR0A1" />
            <bitfield mask="0x00000004" name="SR0A2" />
            <bitfield mask="0x00000008" name="SR0A3" />
            <bitfield mask="0x00000010" name="SR0A4" />
            <bitfield mask="0x00000020" name="SR0A5" />
            <bitfield mask="0x00000040" name="SR0A6" />
            <bitfield mask="0x00000080" name="SR0A7" />
            <bitfield mask="0x00000200" name="SR0A9" />
            <bitfield mask="0x00000400" name="SR0A10" />
            <bitfield mask="0x00004000" name="SR0A14" />
            <bitfield mask="0x00008000" name="SR0A15" />
         </register>
         <register caption="" name="SRCON0B" offset="0x1c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR0B0" />
            <bitfield mask="0x00000002" name="SR0B1" />
            <bitfield mask="0x00000004" name="SR0B2" />
            <bitfield mask="0x00000008" name="SR0B3" />
            <bitfield mask="0x00000010" name="SR0B4" />
            <bitfield mask="0x00000020" name="SR0B5" />
            <bitfield mask="0x00000040" name="SR0B6" />
            <bitfield mask="0x00000080" name="SR0B7" />
            <bitfield mask="0x00000100" name="SR0B8" />
            <bitfield mask="0x00000200" name="SR0B9" />
            <bitfield mask="0x00000400" name="SR0B10" />
            <bitfield mask="0x00000800" name="SR0B11" />
            <bitfield mask="0x00001000" name="SR0B12" />
            <bitfield mask="0x00002000" name="SR0B13" />
            <bitfield mask="0x00004000" name="SR0B14" />
            <bitfield mask="0x00008000" name="SR0B15" />
         </register>
         <register caption="" name="SRCON0C" offset="0x2c0" rw="RW" size="4">
            <bitfield mask="0x00000002" name="SR0C1" />
            <bitfield mask="0x00000004" name="SR0C2" />
            <bitfield mask="0x00000008" name="SR0C3" />
            <bitfield mask="0x00000010" name="SR0C4" />
            <bitfield mask="0x00001000" name="SR0C12" />
            <bitfield mask="0x00002000" name="SR0C13" />
            <bitfield mask="0x00004000" name="SR0C14" />
            <bitfield mask="0x00008000" name="SR0C15" />
         </register>
         <register caption="" name="SRCON0D" offset="0x3c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR0D0" />
            <bitfield mask="0x00000002" name="SR0D1" />
            <bitfield mask="0x00000004" name="SR0D2" />
            <bitfield mask="0x00000008" name="SR0D3" />
            <bitfield mask="0x00000010" name="SR0D4" />
            <bitfield mask="0x00000020" name="SR0D5" />
            <bitfield mask="0x00000040" name="SR0D6" />
            <bitfield mask="0x00000080" name="SR0D7" />
            <bitfield mask="0x00000200" name="SR0D9" />
            <bitfield mask="0x00000400" name="SR0D10" />
            <bitfield mask="0x00000800" name="SR0D11" />
            <bitfield mask="0x00001000" name="SR0D12" />
            <bitfield mask="0x00002000" name="SR0D13" />
            <bitfield mask="0x00004000" name="SR0D14" />
            <bitfield mask="0x00008000" name="SR0D15" />
         </register>
         <register caption="" name="SRCON0E" offset="0x4c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR0E0" />
            <bitfield mask="0x00000002" name="SR0E1" />
            <bitfield mask="0x00000004" name="SR0E2" />
            <bitfield mask="0x00000008" name="SR0E3" />
            <bitfield mask="0x00000010" name="SR0E4" />
            <bitfield mask="0x00000020" name="SR0E5" />
            <bitfield mask="0x00000040" name="SR0E6" />
            <bitfield mask="0x00000080" name="SR0E7" />
            <bitfield mask="0x00000100" name="SR0E8" />
            <bitfield mask="0x00000200" name="SR0E9" />
         </register>
         <register caption="" name="SRCON0F" offset="0x5c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR0F0" />
            <bitfield mask="0x00000002" name="SR0F1" />
            <bitfield mask="0x00000004" name="SR0F2" />
            <bitfield mask="0x00000008" name="SR0F3" />
            <bitfield mask="0x00000010" name="SR0F4" />
            <bitfield mask="0x00000020" name="SR0F5" />
            <bitfield mask="0x00000100" name="SR0F8" />
            <bitfield mask="0x00001000" name="SR0F12" />
            <bitfield mask="0x00002000" name="SR0F13" />
         </register>
         <register caption="" name="SRCON0G" offset="0x6c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR0G0" />
            <bitfield mask="0x00000002" name="SR0G1" />
            <bitfield mask="0x00000040" name="SR0G6" />
            <bitfield mask="0x00000080" name="SR0G7" />
            <bitfield mask="0x00000100" name="SR0G8" />
            <bitfield mask="0x00000200" name="SR0G9" />
            <bitfield mask="0x00001000" name="SR0G12" />
            <bitfield mask="0x00002000" name="SR0G13" />
            <bitfield mask="0x00004000" name="SR0G14" />
            <bitfield mask="0x00008000" name="SR0G15" />
         </register>
         <register caption="" name="SRCON0H" offset="0x7c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR0H0" />
            <bitfield mask="0x00000002" name="SR0H1" />
            <bitfield mask="0x00000004" name="SR0H2" />
            <bitfield mask="0x00000008" name="SR0H3" />
            <bitfield mask="0x00000010" name="SR0H4" />
            <bitfield mask="0x00000020" name="SR0H5" />
            <bitfield mask="0x00000040" name="SR0H6" />
            <bitfield mask="0x00000080" name="SR0H7" />
            <bitfield mask="0x00000100" name="SR0H8" />
            <bitfield mask="0x00000200" name="SR0H9" />
            <bitfield mask="0x00000400" name="SR0H10" />
            <bitfield mask="0x00000800" name="SR0H11" />
            <bitfield mask="0x00001000" name="SR0H12" />
            <bitfield mask="0x00002000" name="SR0H13" />
            <bitfield mask="0x00004000" name="SR0H14" />
            <bitfield mask="0x00008000" name="SR0H15" />
         </register>
